Revit 2026 API

# Transform1D(Double) Constructor

---

Constructs the transformation by specifying the scale only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform1D(
	double scale
)
```
```vb
Public Sub New (
	scale As Double
)
```
```cpp
public:
Transform1D(
	double scale
)
```
```fsharp
new :
        scale : float -> Transform1D
```

#### Parameters

scale Double
     The scale of the transformation.

The translation is set to zero. 1D space is tranformed according to the following formula: t --> scale*t + translation This constructor sets translation to zero.

#### Reference

Transform1D Class

Transform1D Overload

Autodesk.Revit.DB Namespace